Repository: raetsky-dmitry/rds-ai-image-generator-for-posts
Catalog: languages/aigfp-*.po
Languages: ru_ru

source: Generates images for posts using AI via Puter.js
ru_ru: Генерирует изображения для постов с помощью ИИ через Puter.js

source: No script kiddies please!
ru_ru: Пожалуйста, никаких скрипт-кидди!

source: Settings
ru_ru: Настройки

source: AI Image Generator Settings
ru_ru: Настройки AI Image Generator

source: Generate AI Image
ru_ru: Сгенерировать изображение

source: Generate a featured image for this post using AI.
ru_ru: Сгенерировать изображение для записи с помощью AI.

source: Custom Prompt:
ru_ru: Пользовательский промпт:

source: Customize the AI prompt for image generation.
ru_ru: Настройте AI промпт для генерации изображения.

source: Style:
ru_ru: Стиль:

source: Professional
ru_ru: Профессиональный

source: Minimalist
ru_ru: Минималистичный

source: Photorealistic
ru_ru: Фотореалистичный

source: Illustrated
ru_ru: Иллюстрированный

source: Artistic
ru_ru: Артистичный

source: Vintage
ru_ru: Винтажный

source: Futuristic
ru_ru: Футуристичный

source: AI Model:
ru_ru: Модель ИИ:

source: GPT Image 1 Mini (Fastest)
ru_ru: GPT Image 1 Mini (Самая быстрая)

source: GPT Image 1 (Medium)
ru_ru: GPT Image 1 (Средняя)

source: DALL-E 3 (Highest Quality)
ru_ru: DALL-E 3 (Высшее качество)

source: Quality:
ru_ru: Качество:

source: Low (Fastest)
ru_ru: Низкое (Самое быстрое)

source: Medium
ru_ru: Среднее

source: High (Best)
ru_ru: Высокое (Лучшее)

source: Generate Image
ru_ru: Сгенерировать изображение

source: Use as Featured Image
ru_ru: Использовать как миниатюру

source: Generating image...
ru_ru: Генерация изображения...

source: Loading AI engine...
ru_ru: Загрузка ИИI движка...

source: Configure the default settings for AI image generation.
ru_ru: Настройте параметры по умолчанию для генерации AI изображений.

source: Select the default AI model for image generation.
ru_ru: Выберите ИИ модель по умолчанию для генерации изображений.

source: Select the default quality setting.
ru_ru: Выберите настройку качества по умолчанию.

source: Default style for generated images.
ru_ru: Стиль генерируемых изображений по умолчанию.

source: Uploading image...
ru_ru: Загрузка изображения...

source: Puter.js SDK not loaded. Please refresh the page.
ru_ru: Puter.js SDK не загружен. Пожалуйста, обновите страницу.

source: There may not be enough funds. Check your balance on the https://puter.com/dashboard.
ru_ru: Возможно, недостаточно средств. Проверьте баланс на https://puter.com/dashboard.

source: Error generating image:
ru_ru: Ошибка при генерации изображения:

source: Featured image set successfully!
ru_ru: Изображение успешно установлено!

source: Error saving image:
ru_ru: Ошибка при сохранении изображения:

source: Save Settings
ru_ru: Сохранить настройки

source: Usage Instructions
ru_ru: Инструкции по использованию

source: Create or edit a post
ru_ru: Создайте или отредактируйте запись

source: Find the "Generate AI Image" meta box in the sidebar
ru_ru: Найдите метабокс "AI Image Generator" в боковой панели

source: Adjust the prompt if needed
ru_ru: При необходимости отредактируйте промпт

source: Click "Generate Image"
ru_ru: Нажмите "Сгенерировать изображение"

source: Use the generated image as featured image
ru_ru: Используйте сгенерированное изображение как миниатюру

source: About Puter.js
ru_ru: О Puter.js

source: This plugin uses the User-Pays Model. Users pay for their own AI credits when generating images.
ru_ru: Этот плагин использует модель "Пользователь платит". Пользователи оплачивают свои собственные AI кредиты при генерации изображений.

source: This plugin uses a user-based payment model.
ru_ru: Этот плагин использует пользовательскую модель оплаты.

source: This means that you, as the user, will control and pay for the use of artificial intelligence to generate images. The cost of generating one image depends on the selected AI model and quality score and is approximately $0.005 per image. Registration on piter.com will occur automatically the first time you open the post editing page, without the need to enter an email address, password, or anything else. Subsequently, you will be directly logged into your account. No additional authentication is required.
ru_ru: Это означает, что вы, как пользователь, будете контролировать и оплачивать использование искусственного интеллекта для генерации изображений. Стоимость генерации одного изображения зависит от выбранной AI модели и уровня качества и составляет примерно $0.005 за изображение. Регистрация на piter.com произойдет автоматически при первом открытии страницы редактирования записи, без необходимости вводить email, пароль или что-либо еще. Впоследствии вы будете автоматически входить в свой аккаунт. Дополнительная аутентификация не требуется.

source: Upon registration, you will be credited with a certain amount of money, which you can use to test our plugin. Monitor your balance on the Puter.com dashboard.
ru_ru: При регистрации вам будет зачислена определенная сумма денег, которую вы можете использовать для тестирования нашего плагина. Следите за балансом в панели управления Puter.com.

source: Open Puter Dashboard
ru_ru: Открыть Puter Dashboard

source: Learn more
ru_ru: Узнать больше

source: Important Information and Disclaimer
ru_ru: Важная информация и отказ от ответственности

source: 1. Third-party AI Service:
ru_ru: 1. Сторонний ИИ сервис:

source: This plugin uses the third-party Puter.js service for image generation. The developers of Puter.js are in no way affiliated with the developers of this plugin and are not responsible for its operation.
ru_ru: Этот плагин использует сторонний сервис Puter.js для генерации изображений. Разработчики Puter.js никак не связаны с разработчиками этого плагина и не несут ответственности за его работу.

source: 2. Free Distribution:
ru_ru: 2. Бесплатное распространение:

source: The "AI Image Generator for Posts" plugin is provided completely free of charge and on an "AS IS" basis, without any warranties.
ru_ru: Плагин "AI Image Generator for Posts" предоставляется совершенно бесплатно и на условиях "КАК ЕСТЬ", без каких-либо гарантий.

source: 3. User-Pays Model:
ru_ru: 3. Модель "Пользователь платит":

source: The plugin operates on a "user-pays" model. All financial transactions for image generation occur directly between the user and the Puter.com service.
ru_ru: Плагин работает по модели "пользователь платит". Все финансовые операции за генерацию изображений происходят напрямую между пользователем и сервисом Puter.com.

source: 4. Financial Matters:
ru_ru: 4. Финансовые вопросы:

source: All issues related to payments, charges, pricing, refunds, and other financial aspects must be resolved directly with Puter.com administration through their official support channels.
ru_ru: Все вопросы, связанные с платежами, списаниями, ценообразованием, возвратами и другими финансовыми аспектами, должны решаться напрямую с администрацией Puter.com через их официальные каналы поддержки.

source: 5. Liability:
ru_ru: 5. Ответственность:

source: The developers of this plugin are not responsible for:
ru_ru: Разработчики этого плагина не несут ответственности за:

source: The operation and availability of the Puter.js service
ru_ru: Работу и доступность сервиса Puter.js

source: The quality of generated images
ru_ru: Качество сгенерированных изображений

source: Financial disputes with Puter.com
ru_ru: Финансовые споры с Puter.com

source: Changes to Puter.js API or pricing
ru_ru: Изменения в API Puter.js или ценах

source: Data loss or any other damages
ru_ru: Потерю данных или любые другие повреждения

source: Insufficient permissions
ru_ru: Недостаточно прав

source: AI Generated: %s
ru_ru: Сгенерировано ИИ:

source: Generated with Puter.js AI
ru_ru: Сгенерировано с помощью Puter.js

source: AI Generated Image
ru_ru: Изображение сгенерированное ИИ

source: Failed to generate prompt for post #%d
ru_ru: Не удалось сгенерировать промпт для поста

source: Loading Puter.js SDK...
ru_ru: Загрузка Puter.js SDK...

source: Puter.js SDK loaded successfully
ru_ru: Puter.js SDK успешно загружен

source: Failed to load Puter.js SDK
ru_ru: Не удалось загрузить Puter.js SDK

source: Failed to load AI engine. Please check your internet connection and refresh the page.
ru_ru: Не удалось загрузить AI движок. Пожалуйста, проверьте подключение к интернету и обновите страницу.

source: Puter.js SDK already loaded
ru_ru: Puter.js SDK уже загружен
